----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  H:\CHSE\ActiveProjects\Sandbox\NDCTranslation\020TestTranslation.log
  log type:  text
 opened on:   5 Feb 2014, 15:27:04

. 
. insheet using "H:\CHSE\ActiveProjects\Sandbox\NDCTranslation\dataForTesting.txt", clear
(21 vars, 300 obs)

. 
. gen     isFmt442 = 0

. replace isFmt442 = 1 if regexm(ndcpackagecode, "[a-zA-Z0-9][a-zA-Z0-9][a-zA-Z0-9][a-zA-Z0-9]-[a-zA-Z0-9][a-zA-Z0-9][a-zA-Z0-9][a-zA-Z0-9]-[a-zA-Z0-9][a-zA-Z0-9]")
(100 real changes made)

. 
. gen     isFmt532 = 0

. replace isFmt532 = 1 if regexm(ndcpackagecode, "[a-zA-Z0-9][a-zA-Z0-9][a-zA-Z0-9][a-zA-Z0-9][a-zA-Z0-9]-[a-zA-Z0-9][a-zA-Z0-9][a-zA-Z0-9]-[a-zA-Z0-9][a-zA-Z0-9]")
(100 real changes made)

. 
. gen     isFmt541 = 0

. replace isFmt541 = 1 if regexm(ndcpackagecode, "[a-zA-Z0-9][a-zA-Z0-9][a-zA-Z0-9][a-zA-Z0-9][a-zA-Z0-9]-[a-zA-Z0-9][a-zA-Z0-9][a-zA-Z0-9][a-zA-Z0-9]-[a-zA-Z0-9]")
(100 real changes made)

. 
. gen     fmt = "            "

. replace fmt = "4-4-2 format" if isFmt442 
(100 real changes made)

. replace fmt = "5-3-2 format" if isFmt532 
(100 real changes made)

. replace fmt = "5-4-1 format" if isFmt541 
(100 real changes made)

. tabulate fmt

         fmt |      Freq.     Percent        Cum.
-------------+-----------------------------------
4-4-2 format |        100       33.33       33.33
5-3-2 format |        100       33.33       66.67
5-4-1 format |        100       33.33      100.00
-------------+-----------------------------------
       Total |        300      100.00

. 
. gen ndcPackageSeg1 = regexs(1) if regexm(ndcpackagecode, "([a-zA-Z0-9]+)-*([a-zA-Z0-9]+)-*([a-zA-Z0-9]+)")

. gen ndcPackageSeg2 = regexs(2) if regexm(ndcpackagecode, "([a-zA-Z0-9]+)-*([a-zA-Z0-9]+)-*([a-zA-Z0-9]+)")

. gen ndcPackageSeg3 = regexs(3) if regexm(ndcpackagecode, "([a-zA-Z0-9]+)-*([a-zA-Z0-9]+)-*([a-zA-Z0-9]+)")

. 
. gen     ndcPackageFmt11 = "           "

. replace ndcPackageFmt11 = "0" + ndcPackageSeg1 +       ndcPackageSeg2 +       ndcPackageSeg3 if isFmt442
(100 real changes made)

. replace ndcPackageFmt11 =       ndcPackageSeg1 + "0" + ndcPackageSeg2 +       ndcPackageSeg3 if isFmt532
(100 real changes made)

. replace ndcPackageFmt11 =       ndcPackageSeg1 +       ndcPackageSeg2 + "0" + ndcPackageSeg3 if isFmt541
(100 real changes made)

. 
. outsheet using "H:\CHSE\ActiveProjects\Sandbox\NDCTranslation\dataForTestingTranslated.txt", noquote replace

. 
end of do-file

